#include <stdio.h>
#include <locale.h>// підключення бібліотек
#include <math.h>
#include <stdlib.h>
#define N 6// розмір масиву 
int main() {
    int B[N]; // масив
    setlocale(LC_ALL, "ukr"); // встановлення локалізації

    printf("Введiть 6  елементiв матрицi\n");//заповнення масиву користувачем
    for (int i = 0; i < N; i++) {
        printf("Елемет з iндексом %d:", i );
        scanf_s("%d", &B[i]);
    }
    int *h;//оголошення покажчика
    int dob = 1;//присвоєння змінній dob значення 1

    for (h = B; h < B + N; h+=2) {//h=B встановлення покажчика на перший елемент масиву 
        dob *= *h; // пошук добутку
        }

   printf("Добуток чисел з парними номерами: %.1d\n", dob);//виведення результату 
    
}
